In [3]:
import pandas as pd

In [1]:
temp_dict ={'Maxine': [38, 37, 39], 'James': [36,35,36], 'Amanda': [37,36,35]}

In [4]:
tempratures = pd.DataFrame(temp_dict)

In [5]:
tempratures

   Maxine  James  Amanda
0      38     36      37
1      37     35      36
2      39     36      35

In [6]:
pd.DataFrame(temp_dict, index=['Morning', 'Afternoon', 'Evening'])

           Maxine  James  Amanda
Morning        38     36      37
Afternoon      37     35      36
Evening        39     36      35

In [7]:
tempratures['Maxine']

0    38
1    37
2    39
Name: Maxine, dtype: int64

In [8]:
tempratures.index = ['Morning', 'Afternoon', 'Evening']

In [9]:
tempratures['Maxine']

Morning      38
Afternoon    37
Evening      39
Name: Maxine, dtype: int64

In [11]:
tempratures.loc['Morning']

Maxine    38
James     36
Amanda    37
Name: Morning, dtype: int64

In [13]:
tempratures.loc[['Morning','Evening']]

         Maxine  James  Amanda
Morning      38     36      37
Evening      39     36      35

In [15]:
tempratures[['Amanda','Maxine']]

           Amanda  Maxine
Morning        37      38
Afternoon      36      37
Evening        35      39

In [16]:
tempratures.loc['Morning':'Afternoon',['Amanda','Maxine']]

           Amanda  Maxine
Morning        37      38
Afternoon      36      37

In [17]:
tempratures.describe()

       Maxine      James  Amanda
count     3.0   3.000000     3.0
mean     38.0  35.666667    36.0
std       1.0   0.577350     1.0
min      37.0  35.000000    35.0
25%      37.5  35.500000    35.5
50%      38.0  36.000000    36.0
75%      38.5  36.000000    36.5
max      39.0  36.000000    37.0

In [18]:
tempratures.T

        Morning  Afternoon  Evening
Maxine       38         37       39
James        36         35       36
Amanda       37         36       35

In [19]:
tempratures.sort_index(axis=1)

           Amanda  James  Maxine
Morning        37     36      38
Afternoon      36     35      37
Evening        35     36      39